app/Controllers/Kasir/Dashboard.php

SELECT COALESCE(SUM(total_amount), 0) AS total_hari_ini, COUNT(*) AS trx_hari_ini
FROM `sales`
WHERE `user_id` = '2'
AND DATE(sale_date) = '2025-12-11'
 LIMIT 1
---
    public function index()
    {
        $userId = session()->get('user_id');
        $namaKasir = session()->get('nama') ?? 'Kasir';

        // Tanggal hari ini (format YYYY-mm-dd)
        $today = date('Y-m-d');

        // Ambil total penjualan & jumlah transaksi kasir hari ini
        // (kalau kamu sudah punya query versi lain, boleh pakai punyamu;
        // yang penting hasil akhirnya $totalHariIni & $trxHariIni)
        $row = $this->saleModel
            ->select('COALESCE(SUM(total_amount), 0) AS total_hari_ini, COUNT(*) AS trx_hari_ini')
            ->where('user_id', $userId)
            ->where('DATE(sale_date)', $today)
            ->first();