app/Controllers/Kasir/Pos.php

SELECT `id`, `nama`, `barcode`, `harga_jual`, `stok`, `satuan`
FROM `products`
WHERE   (
`nama` LIKE '%sampoe%' ESCAPE '!'
OR  `barcode` LIKE '%sampoe%' ESCAPE '!'
 )
ORDER BY `nama` ASC
 LIMIT 10
---
    public function searchProductAjax()
    {
        if (! $this->request->isAJAX()) {
            return $this->response
                ->setStatusCode(400)
                ->setJSON([
                    'status'  => 'error',
                    'message' => 'Bad request',
                ]);
        }

        $q = trim((string) $this->request->getGet('q'));

        if ($q === '') {
            return $this->response->setJSON([
                'status' => 'ok',
                'data'   => [],
            ]);
        }

        $products = $this->productModel
            ->select('id, nama, barcode, harga_jual, stok, satuan')
            ->groupStart()
                ->like('nama', $q)
                ->orLike('barcode', $q)
            ->groupEnd()
            ->orderBy('nama', 'ASC')
            ->limit(10)
            ->find();

SELECT *
FROM `products`
WHERE `barcode` = 'S014'
 LIMIT 1
---
    public function addItem()
    {
        $keyword = trim((string) $this->request->getPost('barcode'));
        $qty     = (int) $this->request->getPost('qty');

        if ($keyword === '' || $qty <= 0) {
            return redirect()
                ->back()
                ->with('error', 'Barcode / nama barang dan qty harus diisi.');
        }

        // 1) cari barcode
        $product = $this->productModel
            ->where('barcode', $keyword)
            ->first();

SELECT `id`, `nama`, `barcode`, `stok`
FROM `products`
WHERE `id` IN (41)
---
    public function checkout()
    {
        $cart = session()->get('cart') ?? [];

        if (empty($cart)) {
            return redirect()
                ->back()
                ->with('error', 'Cart masih kosong.');
        }

        // --- Cek stok dulu ---
        $productIds = array_keys($cart);
        $products   = [];

        if (! empty($productIds)) {
            $products = $this->productModel
                ->select('id, nama, barcode, stok')
                ->whereIn('id', $productIds)
                ->findAll();

INSERT INTO `sales` (`invoice_no`, `user_id`, `sale_date`, `total_amount`, `total_cost`, `payment_method`, `amount_paid`, `change_amount`) VALUES ('INV20251211150105', '2', '2025-12-11 15:01:05', 15000, 12000, 'qris', 15000, 0)
---
        $db->transStart();

        // Simpan sale
        $saleId = $this->saleModel->insert([
            'invoice_no'     => $invoiceNo,
            'user_id'        => $userId,
            'sale_date'      => $saleDate,
            'total_amount'   => $totalAmount,
            'total_cost'     => $totalCost,
            'payment_method' => $paymentMethod,
            'amount_paid'    => $amountPaid,
            'change_amount'  => $change,
        ], true);

INSERT INTO `sale_items` (`sale_id`, `product_id`, `qty`, `price`, `cost`, `subtotal`, `subtotal_cost`) VALUES (17, 41, 1, 15000, 12000, 15000, 12000)
UPDATE `products` SET `stok` = stok - 1
WHERE `id` = 41
---
        $productTable = $db->table('products');

        foreach ($cart as $item) {
            $this->saleItemModel->insert([
                'sale_id'       => $saleId,
                'product_id'    => $item['product_id'],
                'qty'           => $item['qty'],
                'price'         => $item['harga_jual'],
                'cost'          => $item['harga_beli'],
                'subtotal'      => $item['qty'] * $item['harga_jual'],
                'subtotal_cost' => $item['qty'] * $item['harga_beli'],
            ]);

            $productTable
                ->set('stok', 'stok - ' . (int) $item['qty'], false)
                ->where('id', $item['product_id'])
                ->update();

SELECT *
FROM `sales`
WHERE `sales`.`id` = '16'
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT `sale_items`.*, `products`.`nama`, `products`.`barcode`, `products`.`satuan`
FROM `sale_items`
JOIN `products` ON `products`.`id` = `sale_items`.`product_id`
WHERE `sale_id` = '16'
---
    public function struk($saleId = null)
    {
        if (! $saleId) {
            return redirect()
                ->to(site_url('kasir/pos'))
                ->with('error', 'Transaksi tidak ditemukan.');
        }

        $sale = $this->saleModel->find($saleId);

        if (! $sale) {
            return redirect()
                ->to(site_url('kasir/pos'))
                ->with('error', 'Transaksi tidak ditemukan.');
        }

        $kasir = $this->userModel->find($sale['user_id']);

        $items = $this->saleItemModel
            ->select('sale_items.*, products.nama, products.barcode, products.satuan')
            ->join('products', 'products.id = sale_items.product_id')
            ->where('sale_id', $saleId)
            ->findAll();